In [1]:
#kaggel

In [2]:
## Pandas Specific Attributes

In [3]:
import pandas as pd

In [5]:
df = pd.read_csv(r'E:/PYTHON/PROJECTS/Techchinest - AI course/Branch Specific/Day 9/sir_data/supermarkets.csv')

In [6]:
df

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [12]:
df['Employees'].idxmax()

2

In [13]:
df.describe()

             ID  Employees
count  6.000000   6.000000
mean   3.500000  15.000000
std    1.870829   6.449806
min    1.000000   8.000000
25%    2.250000  10.500000
50%    3.500000  13.500000
75%    4.750000  18.750000
max    6.000000  25.000000

In [14]:
df.columns

Index(['ID', 'Address', 'City', 'State', 'Country', 'Name', 'Employees'], dtype='object')

In [15]:
df[df.columns[:-2]]

   ID          Address           City             State Country
0   1     3666 21st St  San Francisco          CA 94114     USA
1   2   735 Dolores St  San Francisco          CA 94119     USA
2   3      332 Hill St  San Francisco  California 94114     USA
3   4     3995 23rd St  San Francisco          CA 94114     USA
4   5  1056 Sanchez St  San Francisco        California     USA
5   6  551 Alvarado St  San Francisco          CA 94114     USA

In [16]:
df[df.columns[:-2]].describe()

             ID
count  6.000000
mean   3.500000
std    1.870829
min    1.000000
25%    2.250000
50%    3.500000
75%    4.750000
max    6.000000

In [17]:
df.info

<bound method DataFrame.info of    ID          Address           City             State Country         Name  \
0   1     3666 21st St  San Francisco          CA 94114     USA      Madeira
1   2   735 Dolores St  San Francisco          CA 94119     USA  Bready Shop
2   3      332 Hill St  San Francisco  California 94114     USA  Super River
3   4     3995 23rd St  San Francisco          CA 94114     USA   Ben's Shop
4   5  1056 Sanchez St  San Francisco        California     USA      Sanchez
5   6  551 Alvarado St  San Francisco          CA 94114     USA   Richvalley

   Employees
0          8
1         15
2         25
3         10
4         12
5         20  >

### Panda Strings - This is going to work on series datatypes

In [18]:
df

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [22]:
d = df['Address']

In [24]:
d.str.capitalize()

0       3666 21st st
1     735 dolores st
2        332 hill st
3       3995 23rd st
4    1056 sanchez st
5    551 alvarado st
Name: Address, dtype: object

In [25]:
d.str.cat(sep='##')

'3666 21st St##735 Dolores St##332 Hill St##3995 23rd St##1056 Sanchez St##551 Alvarado St'

#replace
#repeat
things are similar to strings

## Applying Functions on Data

create  new column for initials of city names

In [26]:
df

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

# df['intins'] = df['names'].apply(<#this contains the functions to be applied>)

In [28]:
df['Address'].str.len()

0    12
1    14
2    11
3    12
4    15
5    15
Name: Address, dtype: int64